Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: Baseline Load Phase
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "NeuroVoiceCompanion API Load Flow"
    flow:
      - get:
          url: "/"
      - get:
          url: "/dashboard/1"
      - post:
          url: "/ai/chat"
          json:
            user_id: 1
            message: "what are my reminders"
